# Итак, мы имеем:
#
# Игру «Крестики-нолики».
# Консоль, куда будет выводиться ход игры. Тут делать красиво мы умеем с помощью форматированных строк.
# Неутолимое желание написать что-то реальное своими руками.
# Размер поля предполагается равным 3x3

##print(a, '\n', b, '\n', c, '\n', d, sep='')
a = '0 1 2 3'
b = '1 _ _ _'
c = '2 _ _ _'
d = '3 _ _ _'
s = [a, b, c, d]
print('\n'.join(s))

while True:
    string = int(input('Выберите строку от 1 до 3 = '))
    column = int(input('Выберите столбец от 1 до 3 = '))
    sign = input('Выберите знак x или 0 = ')
    L = s[string]
    L = L.split()
    L[column] = sign
    L = ' '.join(L)
    s[string] = L
    b, c, d = s[1], s[2], s[3]
    print('\n'.join(s))
    if (b[2] == b[4] == b[6] != '_' or c[2] == c[4] == c[6] != '_'
            or d[2] == d[4] == d[6] != '_' or b[2] == c[2] == d[2] != '_'
            or b[4] == c[4] == d[4] != '_' or b[6] == c[6] == d[6] != '_'
            or b[2] == c[4] == d[6] != '_' or b[6] == c[4] == d[2] != '_'):
        print('Победа')
        break
    else:
        if (b[2] != '_' and b[4] != '_' and b[6] != '_' and c[2] != '_'
                and c[4] != '_' and c[6] != '_' and d[2] != '_'
                and d[4] != '_' and d[6] != '_'):
            print('Ничья')
            break
